README.org
#+title: Johan Bolmsjö's GNU Emacs Configuration
#+setupfile:latex-setupfile.org
#+options: date:t num:3
#+date: /2024-10-05/

Installation instruction:
#+begin_src bash
  git clone github.com/johan-bolmsjo/emacs.d ~/.emacs.d
#+end_src

#+toc: headlines 2

* The Init File
:PROPERTIES:
:CUSTOM_ID: init-file
:END:

Requires GNU Emacs version 30.1 or greater.

The main init file is =init.el=.
This file loads packages that require external programs to function properly.
See chapter [[Setup of External Tools]] for how to install required programs for specific packages.

** Overview

Overview of enabled packages.

*** Package Management

Emacs packages are installed using the [[https://github.com/radian-software/straight.el][straight]] package manager.
The advantage with this package manager is that it keeps the complete upstream Git repositories available together with lock files to pin down exact versions.
This means that the Emacs configuration is reproducible.
It's also possible to easily change package versions to resolve incompatibilities when the configuration is
copied between hosts with different Emacs versions.

The version lock file =~/.emacs.d/straight/versions/default.el= is versioned by this Git repository.

The actual upstream package source code is not managed by this Git repository.
They are downloaded by Emacs when started.
For local backup purposes it's possible to just archive the whole =~/.emacs.d= directory.
It's transferable between machines.

*** Documentation Modes

- [[https://protesilaos.com/emacs/denote][Denote]] for structured note taking.
- [[https://orgmode.org/][Org Mode]] for documentation and planning.
- [[https://daringfireball.net/projects/markdown/][Markdown]]
- [[https://plantuml.com/][PlantUML]]

*** Data Formats

- [[https://yaml.org/][YAML]] through [[https://www.emacswiki.org/emacs/YamlMode][yaml-mode]]

*** Programming Languages Modes

All programming language modes except elisp use eglot to provide code navigation and completion support.
Some configuration may be missing for SLIME as I've barely used it.

- C/C++ (builtin)
- [[https://lisp-lang.org/][Common Lisp]] using [[https://slime.common-lisp.dev/][SLIME]]
- [[https://www.gnu.org/software/emacs/manual/html_node/elisp/index.html][elisp]] (builtin)
- [[https://go.dev/][Go]]
- [[https://ocaml.org/][OCaml]] (externally managed)
- [[https://www.python.org/][Python]] (builtin)
- [[https://ziglang.org/][Zig]]

*** Miscellaneous Support Functions

- Improved minibuffer completions through [[https://github.com/minad/vertico][Vertico]], [[https://github.com/minad/marginalia][Marginalia]] and [[https://github.com/oantolin/orderless][Orderless]].
- Collection of minibuffer utilities provided by [[https://github.com/minad/consult][Consult]].
- Context aware minibuffer actions through [[https://github.com/oantolin/embark][Embark]].
- Code completion through [[https://github.com/minad/corfu][Corfu]] and [[https://github.com/oantolin/orderless][Orderless]].
- Templated auto complete assisted snippets through [[https://github.com/joaotavora/yasnippet][Yasnippet]].
- Project like IDE support using [[https://github.com/Alexander-Miller/treemacs][Treemacs]], [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Projects.html][project.el]] and [[https://github.com/joaotavora/eglot][Eglot]].
- Compiler diagnostics through [[https://www.flycheck.org/en/latest/][Flycheck]] or [[https://www.gnu.org/software/emacs/manual/html_mono/flymake.html][Flymake]].
- Git interface through [[https://magit.vc/][Magit]].
- GDB support through [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Debuggers.html][GUD]].
- Extraneous whitespace indications.

** Keybindings

Keybindings that are specific to this configuration file.

*** User Keybindings

See https://www.gnu.org/software/emacs/manual/html_node/elisp/Key-Binding-Conventions.html for user keybinding conventions.
Also http://xahlee.info/emacs/emacs/keyboard_shortcuts.html for practical overrides.

- =C-c a= :: =align-current=
- =C-c c= :: =compile=
- =C-c g= :: =find-grep=
- =C-c i= :: =ispell-region=
- =C-c o= :: =ff-find-other-file= (in c-mode-common)
- =C-c s= :: =sort-lines=
- =C-c t= :: toggle treemacs pane

**** Incremental Search

- =C-c k= :: Set mark at start of current match and exit isearch (user function).

**** Navigation

Even though these functions are called =error=, they work in many contexts. E.g. moving through compilation errors, grep results, xref references.

- =F9= :: =next-error=
- =F10= :: =prev-error= (overrides global menu popup)

**** Window Management

Commands useful to prevent Emacs from splitting frames and replacing buffers in windows when doing certain tasks.

- =C-c F= :: Lock current frame for automatic splitting.
- =C-c f= :: Unlock current frame for automatic splitting.
- =C-c W= :: Lock current window to its current buffer.
- =C-c w= :: Unlock current window from its current buffer.

See https://smythp.com/emacs_buffers/ for an explanation of the frames, windows and buffers terminology.

