html/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Johan Bolmsjö's GNU Emacs Configuration</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://bitmaster.se/css/org-font-optimized.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Johan Bolmsjö's GNU Emacs Configuration</h1>
<p>
Installation instruction:
</p>
<div class="org-src-container">
<pre class="src src-bash">git clone github.com/johan-bolmsjo/emacs.d ~/.emacs.d
</pre>
</div>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#init-file">1. The Init File</a>
<ul>
<li><a href="#org68ff600">1.1. Overview</a></li>
<li><a href="#orgc01e85c">1.2. Keybindings</a></li>
<li><a href="#orge0b6b34">1.3. User Facing Functions</a></li>
<li><a href="#orgb664aff">1.4. Configuration Adaptations</a></li>
</ul>
</li>
<li><a href="#orgbb84ef4">2. Quick Guides</a>
<ul>
<li><a href="#org5a81886">2.1. Navigation</a></li>
<li><a href="#org240181a">2.2. Incremental Search</a></li>
<li><a href="#org40d21d3">2.3. Completion in Buffers</a></li>
<li><a href="#org61a7e37">2.4. Minibuffer Completion</a></li>
<li><a href="#org11ac5e8">2.5. Magit</a></li>
<li><a href="#orgbc07616">2.6. Denote</a></li>
<li><a href="#org502519d">2.7. Org Mode</a></li>
<li><a href="#org2d015bf">2.8. Text Templates</a></li>
<li><a href="#org144e520">2.9. Diagnostics</a></li>
<li><a href="#org68555a3">2.10. Language Server Protocol Support</a></li>
<li><a href="#org70aaa5a">2.11. Keyboard Macros</a></li>
<li><a href="#org54b58fb">2.12. Debugging Using GDB</a></li>
</ul>
</li>
<li><a href="#org2fe1157">3. Setup of External Tools</a>
<ul>
<li><a href="#org560d360">3.1. Terminal Mode Copy+Paste</a></li>
<li><a href="#orgd93c59b">3.2. Shell Script Mode</a></li>
<li><a href="#orgb6cb655">3.3. PlantUML Documentation</a></li>
<li><a href="#org546bc4c">3.4. Go Programming Language Mode</a></li>
<li><a href="#org58689b9">3.5. OCaml Programming Language Mode</a></li>
<li><a href="#orge2fe087">3.6. Python Programming Language Mode</a></li>
<li><a href="#orgf47b1d2">3.7. Zig Programming Language Mode</a></li>
</ul>
</li>
<li><a href="#orgc41fd85">4. Compiling GNU Emacs</a>
<ul>
<li><a href="#orgf62032b">4.1. Emacs 30.2</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-init-file" class="outline-2">
<h2 id="init-file"><span class="section-number-2">1.</span> The Init File</h2>
<div class="outline-text-2" id="text-init-file">
<p>
Requires GNU Emacs version 30.1 or greater.
</p>

<p>
The main init file is <code>init.el</code>.
This file loads packages that require external programs to function properly.
See chapter <a href="#org2fe1157">3</a> for how to install required programs for specific packages.
</p>
</div>
<div id="outline-container-org68ff600" class="outline-3">
<h3 id="org68ff600"><span class="section-number-3">1.1.</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Overview of enabled packages.
</p>
</div>
<div id="outline-container-org2083b4f" class="outline-4">
<h4 id="org2083b4f"><span class="section-number-4">1.1.1.</span> Package Management</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Emacs packages are installed using the <a href="https://github.com/radian-software/straight.el">straight</a> package manager.
The advantage with this package manager is that it keeps the complete upstream Git repositories available together with lock files to pin down exact versions.
This means that the Emacs configuration is reproducible.
It's also possible to easily change package versions to resolve incompatibilities when the configuration is
copied between hosts with different Emacs versions.
</p>

<p>
The version lock file <code>~/.emacs.d/straight/versions/default.el</code> is versioned by this Git repository.
</p>

<p>
The actual upstream package source code is not managed by this Git repository.
They are downloaded by Emacs when started.
For local backup purposes it's possible to just archive the whole <code>~/.emacs.d</code> directory.
It's transferable between machines.
</p>
</div>
</div>
<div id="outline-container-org7ff745e" class="outline-4">
<h4 id="org7ff745e"><span class="section-number-4">1.1.2.</span> Documentation Modes</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li><a href="https://protesilaos.com/emacs/denote">Denote</a> for structured note taking.</li>
<li><a href="https://orgmode.org/">Org Mode</a> for documentation and planning.</li>
<li><a href="https://daringfireball.net/projects/markdown/">Markdown</a></li>
<li><a href="https://plantuml.com/">PlantUML</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgaf39ad1" class="outline-4">
<h4 id="orgaf39ad1"><span class="section-number-4">1.1.3.</span> Data Formats</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li><a href="https://yaml.org/">YAML</a> through <a href="https://www.emacswiki.org/emacs/YamlMode">yaml-mode</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3062602" class="outline-4">
<h4 id="org3062602"><span class="section-number-4">1.1.4.</span> Programming Languages Modes</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
All programming language modes except elisp use eglot to provide code navigation and completion support.
Some configuration may be missing for SLIME as I've barely used it.
</p>

<ul class="org-ul">
<li>C/C++ (builtin)</li>
<li><a href="https://lisp-lang.org/">Common Lisp</a> using <a href="https://slime.common-lisp.dev/">SLIME</a></li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/index.html">elisp</a> (builtin)</li>
<li><a href="https://go.dev/">Go</a></li>
<li><a href="https://ocaml.org/">OCaml</a> (externally managed)</li>
<li><a href="https://www.python.org/">Python</a> (builtin)</li>
<li><a href="https://ziglang.org/">Zig</a></li>
</ul>
</div>
</div>
<div id="outline-container-org17a3c96" class="outline-4">
<h4 id="org17a3c96"><span class="section-number-4">1.1.5.</span> Miscellaneous Support Functions</h4>
<div class="outline-text-4" id="text-1-1-5">
<ul class="org-ul">
<li>Improved minibuffer completions through <a href="https://github.com/minad/vertico">Vertico</a>, <a href="https://github.com/minad/marginalia">Marginalia</a> and <a href="https://github.com/oantolin/orderless">Orderless</a>.</li>
<li>Collection of minibuffer utilities provided by <a href="https://github.com/minad/consult">Consult</a>.</li>
<li>Context aware minibuffer actions through <a href="https://github.com/oantolin/embark">Embark</a>.</li>
<li>Code completion through <a href="https://github.com/minad/corfu">Corfu</a> and <a href="https://github.com/oantolin/orderless">Orderless</a>.</li>
<li>Templated auto complete assisted snippets through <a href="https://github.com/joaotavora/yasnippet">Yasnippet</a>.</li>
<li>Project like IDE support using <a href="https://github.com/Alexander-Miller/treemacs">Treemacs</a>, <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Projects.html">project.el</a> and <a href="https://github.com/joaotavora/eglot">Eglot</a>.</li>
<li>Compiler diagnostics through <a href="https://www.flycheck.org/en/latest/">Flycheck</a> or <a href="https://www.gnu.org/software/emacs/manual/html_mono/flymake.html">Flymake</a>.</li>
<li>Git interface through <a href="https://magit.vc/">Magit</a>.</li>
<li>GDB support through <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Debuggers.html">GUD</a>.</li>
<li>Extraneous whitespace indications.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc01e85c" class="outline-3">
<h3 id="orgc01e85c"><span class="section-number-3">1.2.</span> Keybindings</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Keybindings that are specific to this configuration file.
</p>
</div>
<div id="outline-container-org672a6d6" class="outline-4">
<h4 id="org672a6d6"><span class="section-number-4">1.2.1.</span> User Keybindings</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
See <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Key-Binding-Conventions.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Key-Binding-Conventions.html</a> for user keybinding conventions.
Also <a href="http://xahlee.info/emacs/emacs/keyboard_shortcuts.html">http://xahlee.info/emacs/emacs/keyboard_shortcuts.html</a> for practical overrides.
</p>

<dl class="org-dl">
<dt><code>C-c a</code></dt><dd><code>align-current</code></dd>
<dt><code>C-c c</code></dt><dd><code>compile</code></dd>
<dt><code>C-c g</code></dt><dd><code>find-grep</code></dd>
<dt><code>C-c i</code></dt><dd><code>ispell-region</code></dd>
<dt><code>C-c o</code></dt><dd><code>ff-find-other-file</code> (in c-mode-common)</dd>
<dt><code>C-c s</code></dt><dd><code>sort-lines</code></dd>
<dt><code>C-c t</code></dt><dd>toggle treemacs pane</dd>
</dl>
</div>
<div id="outline-container-org5ad70e0" class="outline-5">
<h5 id="org5ad70e0">Incremental Search</h5>
<div class="outline-text-5" id="text-org5ad70e0">
<dl class="org-dl">
<dt><code>C-c k</code></dt><dd>Set mark at start of current match and exit isearch (user function).</dd>
</dl>
</div>
</div>
<div id="outline-container-org1de8992" class="outline-5">
<h5 id="org1de8992">Navigation</h5>
<div class="outline-text-5" id="text-org1de8992">
<p>
Even though these functions are called <code>error</code>, they work in many contexts. E.g. moving through compilation errors, grep results, xref references.
</p>

<dl class="org-dl">
<dt><code>F9</code></dt><dd><code>next-error</code></dd>
<dt><code>F10</code></dt><dd><code>prev-error</code> (overrides global menu popup)</dd>
</dl>
</div>
</div>
<div id="outline-container-org3ec9b6a" class="outline-5">
<h5 id="org3ec9b6a">Window Management</h5>
<div class="outline-text-5" id="text-org3ec9b6a">
<p>
Commands useful to prevent Emacs from splitting frames and replacing buffers in windows when doing certain tasks.
</p>

<dl class="org-dl">
<dt><code>C-c F</code></dt><dd>Lock current frame for automatic splitting.</dd>
<dt><code>C-c f</code></dt><dd>Unlock current frame for automatic splitting.</dd>
<dt><code>C-c W</code></dt><dd>Lock current window to its current buffer.</dd>
<dt><code>C-c w</code></dt><dd>Unlock current window from its current buffer.</dd>
</dl>

<p>
See <a href="https://smythp.com/emacs_buffers/">https://smythp.com/emacs_buffers/</a> for an explanation of the frames, windows and buffers terminology.
</p>
</div>
</div>
