README.org
**** Denote

- =C-c n= :: Command prefix

The main note taking command is =C-c n n=.
Other keybindings are listed when entering the command prefix.
Discover all commands by entering =M-x denote=

**** Org Mode

- =C-c p= :: =org-agenda= (planning)
- =C-c L= :: =org-store-link= (works in other modes to store links)

**** Eglot Mode

Note that eglot relies on the keybindings of other packages for most functions.
E.g. xref for navigation and eldoc for documentation.

- =C-c e a= :: =eglot-code-actions=
- =C-c e f= :: =eglot-format= (ask server to format buffer or the active region)
- =C-c e r= :: =eglot-rename= (rename symbol at point)
- =C-c e i= :: =eglot-find-implementation=
- =C-c e t= :: =eglot-find-typeDefinition=

**** Flymake Mode

Aligned with flycheck counterparts.

- =C-c ! l= :: =flymake-show-buffer-diagnostics=
- =C-c ! n= :: =flymake-goto-next-error=
- =C-c ! p= :: =flymake-goto-prev-error=

**** Embark

[[https://github.com/oantolin/embark][Embark]] executes context aware actions.
For example opening the URL that the cursor is placed on in a buffer.
It extends some of the consult commands by making it possible to export the current selection to regular buffers for easier manipulation.

- =C-c v= :: Execute action on current context
- =C-c d= :: "Do what I mean" on current context
- =C-h B= :: =embark-bindings=; alternative for `describe-bindings'

**** GDB (debugger)

- =F5= :: Continue program being debugged.
- =F6= :: Step till next source line, do not enter subroutine (next).
- =F7= :: Step till next source line, enter subroutine (step).
- =F8= :: Execute until current stack frame returns.
- =S-F8= :: Stop debugging

*** Overridden Keybindings

Modifies standard Emacs behavior or use non-user prefix.

- =F10= :: =prev-error= (overrides global menu popup)
- =M-n= :: =scroll-up-command=
- =M-p= :: =scroll-down-command=
- =M-f= :: =forward-symbol= (replaces forward-word)
- =M-b= :: =my/backward-symbol= (replaces backward-word)
- =C-x k= :: =my/fast-kill-buffer= (replaces kill-buffer)

** User Facing Functions

Convenience functions defined by the configuration.

- =reload-file= :: Calls =revert-buffer= without asking for confirmation

** Configuration Adaptations

Configuration adaptations that may be desired when applying this Emacs configuration in a new environment.

*** Terminal Emulator

The solarized theme that is used by this Emacs configuration only works properly in graphical mode and terminals that support true color.

The website https://github.com/termstandard/colors describes how to configure terminals and associated tools to support true color.

In essence, the environment variable =COLORTERM= must be set to =truecolor=.
=COLORTERM= is distinct from the usual =TERM= environment variable that communicate terminal capabilities.
Obviously the underlying terminal must also support the true color escape codes.

My =~/.bashrc= contains the following lines to set it for the suckless terminal:

#+begin_src bash
  # Set the COLORTERM variable to "truecolor" if the terminal supports it.
  # The suckless terminal (st) definitely does.
  # The tmux-256color can be any underlying type so is technically incorrect;
  # it solves the issue of SSH to remote system from within a Tmux session.
  if [ "$TERM" = st-256color ] || [ "$TERM" = tmux-256color ]; then
     export COLORTERM=truecolor
  fi
#+end_src

*** Shell Environment                                            :optional:

Suggested Emacs shell integration.

Set the ~EDITOR~ environment variable to emacs in =~/.profile= or other shell login environment script.

#+begin_src bash
  # Set preferred editor invoked by some command line tools.
  export EDITOR="emacs -nw"
#+end_src

Add a convenience command alias to e.g. =~/.bashrc= to open a file in Emacs from a terminal.

#+begin_src bash
  # Open file in already started Emacs running in server mode (M-x server-start).
  # Useful to hide Emacs startup cost when editing config files from the shell.
  alias edit='emacsclient -n'
#+end_src

*** Fonts                                                        :optional:

A personal choice, my current favorite monospaced fonts can be found in the =~/.emacs.d/fonts/gofont= directory.

Installation (Linux):
#+begin_src bash
  mkdir -p ~/.fonts
  cp ~/.emacs.d/fonts/gofont/*.ttf ~/.fonts
#+end_src

Update =~/.emacs.d/fonts.el= with your preferred fonts and default size.

*** Custom Variables

Variables that may need customization (such as file paths) are stored in =~/.emacs.d/custom.el=.


* Quick Guides

Scattered quick guides for my own memory.
It could do with more information for Emacs neophytes.

** Navigation

Xref is used by many Emacs modes for navigation, including Eglot for navigating source code.

- =M-,= :: Go back
- =M-.= :: Find thing
- =M-?= :: Find references

Jump to a specific line.

- =M-g g= :: goto-line

