html/README.html
<div id="outline-container-org5c8c8ad" class="outline-5">
<h5 id="org5c8c8ad">Denote</h5>
<div class="outline-text-5" id="text-org5c8c8ad">
<dl class="org-dl">
<dt><code>C-c n</code></dt><dd>Command prefix</dd>
</dl>

<p>
The main note taking command is <code>C-c n n</code>.
Other keybindings are listed when entering the command prefix.
Discover all commands by entering <code>M-x denote</code>
</p>
</div>
</div>
<div id="outline-container-org1210826" class="outline-5">
<h5 id="org1210826">Org Mode</h5>
<div class="outline-text-5" id="text-org1210826">
<dl class="org-dl">
<dt><code>C-c p</code></dt><dd><code>org-agenda</code> (planning)</dd>
<dt><code>C-c L</code></dt><dd><code>org-store-link</code> (works in other modes to store links)</dd>
</dl>
</div>
</div>
<div id="outline-container-org35701f7" class="outline-5">
<h5 id="org35701f7">Eglot Mode</h5>
<div class="outline-text-5" id="text-org35701f7">
<p>
Note that eglot relies on the keybindings of other packages for most functions.
E.g. xref for navigation and eldoc for documentation.
</p>

<dl class="org-dl">
<dt><code>C-c e a</code></dt><dd><code>eglot-code-actions</code></dd>
<dt><code>C-c e f</code></dt><dd><code>eglot-format</code> (ask server to format buffer or the active region)</dd>
<dt><code>C-c e r</code></dt><dd><code>eglot-rename</code> (rename symbol at point)</dd>
<dt><code>C-c e i</code></dt><dd><code>eglot-find-implementation</code></dd>
<dt><code>C-c e t</code></dt><dd><code>eglot-find-typeDefinition</code></dd>
</dl>
</div>
</div>
<div id="outline-container-org9342222" class="outline-5">
<h5 id="org9342222">Flymake Mode</h5>
<div class="outline-text-5" id="text-org9342222">
<p>
Aligned with flycheck counterparts.
</p>

<dl class="org-dl">
<dt><code>C-c ! l</code></dt><dd><code>flymake-show-buffer-diagnostics</code></dd>
<dt><code>C-c ! n</code></dt><dd><code>flymake-goto-next-error</code></dd>
<dt><code>C-c ! p</code></dt><dd><code>flymake-goto-prev-error</code></dd>
</dl>
</div>
</div>
<div id="outline-container-org726a6ff" class="outline-5">
<h5 id="org726a6ff">Embark</h5>
<div class="outline-text-5" id="text-org726a6ff">
<p>
<a href="https://github.com/oantolin/embark">Embark</a> executes context aware actions.
For example opening the URL that the cursor is placed on in a buffer.
It extends some of the consult commands by making it possible to export the current selection to regular buffers for easier manipulation.
</p>

<dl class="org-dl">
<dt><code>C-c v</code></dt><dd>Execute action on current context</dd>
<dt><code>C-c d</code></dt><dd>"Do what I mean" on current context</dd>
<dt><code>C-h B</code></dt><dd><code>embark-bindings</code>; alternative for `describe-bindings'</dd>
</dl>
</div>
</div>
<div id="outline-container-org42b8d05" class="outline-5">
<h5 id="org42b8d05">GDB (debugger)</h5>
<div class="outline-text-5" id="text-org42b8d05">
<dl class="org-dl">
<dt><code>F5</code></dt><dd>Continue program being debugged.</dd>
<dt><code>F6</code></dt><dd>Step till next source line, do not enter subroutine (next).</dd>
<dt><code>F7</code></dt><dd>Step till next source line, enter subroutine (step).</dd>
<dt><code>F8</code></dt><dd>Execute until current stack frame returns.</dd>
<dt><code>S-F8</code></dt><dd>Stop debugging</dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-org2ed4e50" class="outline-4">
<h4 id="org2ed4e50"><span class="section-number-4">1.2.2.</span> Overridden Keybindings</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Modifies standard Emacs behavior or use non-user prefix.
</p>

<dl class="org-dl">
<dt><code>F10</code></dt><dd><code>prev-error</code> (overrides global menu popup)</dd>
<dt><code>M-n</code></dt><dd><code>scroll-up-command</code></dd>
<dt><code>M-p</code></dt><dd><code>scroll-down-command</code></dd>
<dt><code>M-f</code></dt><dd><code>forward-symbol</code> (replaces forward-word)</dd>
<dt><code>M-b</code></dt><dd><code>my/backward-symbol</code> (replaces backward-word)</dd>
<dt><code>C-x k</code></dt><dd><code>my/fast-kill-buffer</code> (replaces kill-buffer)</dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-orge0b6b34" class="outline-3">
<h3 id="orge0b6b34"><span class="section-number-3">1.3.</span> User Facing Functions</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Convenience functions defined by the configuration.
</p>

<dl class="org-dl">
<dt><code>reload-file</code></dt><dd>Calls <code>revert-buffer</code> without asking for confirmation</dd>
</dl>
</div>
</div>
<div id="outline-container-orgb664aff" class="outline-3">
<h3 id="orgb664aff"><span class="section-number-3">1.4.</span> Configuration Adaptations</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Configuration adaptations that may be desired when applying this Emacs configuration in a new environment.
</p>
</div>
<div id="outline-container-org7118c4e" class="outline-4">
<h4 id="org7118c4e"><span class="section-number-4">1.4.1.</span> Terminal Emulator</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
The solarized theme that is used by this Emacs configuration only works properly in graphical mode and terminals that support true color.
</p>

<p>
The website <a href="https://github.com/termstandard/colors">https://github.com/termstandard/colors</a> describes how to configure terminals and associated tools to support true color.
</p>

<p>
In essence, the environment variable <code>COLORTERM</code> must be set to <code>truecolor</code>.
<code>COLORTERM</code> is distinct from the usual <code>TERM</code> environment variable that communicate terminal capabilities.
Obviously the underlying terminal must also support the true color escape codes.
</p>

<p>
My <code>~/.bashrc</code> contains the following lines to set it for the suckless terminal:
</p>

<div class="org-src-container">
<pre class="src src-bash"># Set the COLORTERM variable to "truecolor" if the terminal supports it.
# The suckless terminal (st) definitely does.
# The tmux-256color can be any underlying type so is technically incorrect;
# it solves the issue of SSH to remote system from within a Tmux session.
if [ "$TERM" = st-256color ] || [ "$TERM" = tmux-256color ]; then
   export COLORTERM=truecolor
fi
</pre>
</div>
</div>
</div>
<div id="outline-container-org102e3d8" class="outline-4">
<h4 id="org102e3d8"><span class="section-number-4">1.4.2.</span> Shell Environment&#xa0;&#xa0;&#xa0;<span class="tag"><span class="optional">optional</span></span></h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
Suggested Emacs shell integration.
</p>

<p>
Set the <code>EDITOR</code> environment variable to emacs in <code>~/.profile</code> or other shell login environment script.
</p>

<div class="org-src-container">
<pre class="src src-bash"># Set preferred editor invoked by some command line tools.
export EDITOR="emacs -nw"
</pre>
</div>

<p>
Add a convenience command alias to e.g. <code>~/.bashrc</code> to open a file in Emacs from a terminal.
</p>

<div class="org-src-container">
<pre class="src src-bash"># Open file in already started Emacs running in server mode (M-x server-start).
# Useful to hide Emacs startup cost when editing config files from the shell.
alias edit='emacsclient -n'
</pre>
</div>
</div>
</div>
<div id="outline-container-org3671365" class="outline-4">
<h4 id="org3671365"><span class="section-number-4">1.4.3.</span> Fonts&#xa0;&#xa0;&#xa0;<span class="tag"><span class="optional">optional</span></span></h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
A personal choice, my current favorite monospaced fonts can be found in the <code>~/.emacs.d/fonts/gofont</code> directory.
</p>

<p>
Installation (Linux):
</p>
<div class="org-src-container">
<pre class="src src-bash">mkdir -p ~/.fonts
cp ~/.emacs.d/fonts/gofont/*.ttf ~/.fonts
</pre>
</div>

<p>
Update <code>~/.emacs.d/fonts.el</code> with your preferred fonts and default size.
</p>
</div>
</div>
<div id="outline-container-org59a2252" class="outline-4">
<h4 id="org59a2252"><span class="section-number-4">1.4.4.</span> Custom Variables</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
Variables that may need customization (such as file paths) are stored in <code>~/.emacs.d/custom.el</code>.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbb84ef4" class="outline-2">
<h2 id="orgbb84ef4"><span class="section-number-2">2.</span> Quick Guides</h2>
<div class="outline-text-2" id="text-2">
<p>
Scattered quick guides for my own memory.
It could do with more information for Emacs neophytes.
</p>
</div>
<div id="outline-container-org5a81886" class="outline-3">
<h3 id="org5a81886"><span class="section-number-3">2.1.</span> Navigation</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Xref is used by many Emacs modes for navigation, including Eglot for navigating source code.
</p>

<dl class="org-dl">
<dt><code>M-,</code></dt><dd>Go back</dd>
<dt><code>M-.</code></dt><dd>Find thing</dd>
<dt><code>M-?</code></dt><dd>Find references</dd>
</dl>

<p>
Jump to a specific line.
</p>

<dl class="org-dl">
<dt><code>M-g g</code></dt><dd>goto-line</dd>
</dl>
</div>
</div>
