README.org
** Incremental Search

Don't forget about the occur mode when doing incremental search.
It's very useful to get a navigable outline of all current matches.

All keybindings can be listed by invoking =C-h b= when in search mode.

Starting search:

- =C-s= :: Search forward for a literal string
- =C-r= :: Search backward for a literal string
- =C-M-s= :: Search forward for a regexp
- =C-M-r= :: Search backward for a regexp
- =M-s _= :: Search forward for a symbol
- =M-s .= :: Search forward for the symbol at point

During search:

- =C-s= :: Move to next match (=C-s C-s= to resume search)
- =C-r= :: Move to previous match (=C-r C-r= to resume search)
- =C-g= :: Abort search
- =M-c= :: Toggle case sensitive search
- =M-e= :: Edit search term
- =M-s o= :: Outline of current matches (occur)
- =M-s SPC= :: Toggle lax whitespace
- =RET= :: Terminate search, leaving cursor at the current match

** Completion in Buffers

Completion is provided by [[https://github.com/minad/corfu][Corfu]] together with [[https://github.com/oantolin/orderless][Orderless]].
Completion is triggered by =C-M-i= which is bound to =complete-symbol=.
The TAB key is also configured to either indent (if it can), else complete.
This does not work in the C/C++ mode.

The completion mechanism provided by orderless is a bit different and can take some time to get used to.
Multiple patterns (space separated words) can be entered.
Completions candidates that match all patterns regardless of order are kept.
Patterns can be regexps as well as regular words, e.g. =^desc= match candidates starting with =desc=.

The built-in [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Dynamic-Abbrevs.html][dabbrev]] mode can also be useful.

- =M-/= :: dabbrev-expand
- =C-M-/= :: dabbrev-completion

** Minibuffer Completion

[[https://github.com/minad/vertico][Vertico]] together with [[https://github.com/minad/marginalia][Marginalia]] and [[https://github.com/oantolin/orderless][Orderless]] is used to enhance minibuffer completions.
For example selecting buffers, files or the function to invoke via =M-x=.

- =TAB=   :: Navigate to selected candidate
- =RET=   :: Accept selected candidate
- =M-RET= :: Submit exactly what is typed (ignore candidate completion)
- =C-g=   :: Abort (as always)

Searching for previous selections is done using =C-s= and =C-r=.
Navigation is performed using the usual keybindings.

** Magit

[[https://magit.vc][Magit]] is a complete text-based user interface to Git.
The magit status command is bound to =C-x g=.

** Denote

The YouTube presentation https://www.youtube.com/watch?v=mLzFJcLpDFI by the package author gives a good overview of the note taking workflow.
I recommend studying the [[https://protesilaos.com/emacs/denote][manual]] for further details.

** Org Mode

[[http://orgmode.org][Org mode]] is a documentation and planning major mode.
Some HOWTO notes are kept in file:docs/howto-org-mode.org.

The =org-tempo= package is enabled which provides some template instantiation shortcuts.
Invoke =M-x describe-variable= and enter =org-tempo-tags= to see all shortcuts.
Useful shortcuts include =<s= /TAB/ for source blocks and =<q= /TAB/ for quote blocks.

** Text Templates

Text template support is provided by the [[https://github.com/joaotavora/yasnippet][yasnippet]] package. Sippets are kept under\\
=~/.emacs.d/<MODE>/<FILE>= and they are are expanded by typing their name and pressing
/TAB/.

** Diagnostics

Diagnostics such as compiler errors are provied by either the flycheck or flymake package.

** Language Server Protocol Support

[[https://github.com/joaotavora/eglot/blob/master/MANUAL.md][Eglot]] works in concert with project.el to identify [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Projects.html][projects]].
Only version controlled directories can become projects.
Eglot can only analyze files that belongs to a project.

Invoke =M-x p p= to add a project, select the /... (choose a dir)/ option.
Tracked projects are stored in =~/.emacs.d/projects=.

Eglot must be started manually from an opened file that belongs to a project.
This is done by invoking =M-x eglot=.
Eglot may ask for the language server to use if it can't find one or there are multiple choices.
After having done this once, eglot does not prompt for other files in the same project.

Eglot is well integrated with core Emacs packages.
Apart from the mentioned xref it use the eldoc package to display documentation and type information.
Invoke =C-h .= to show documentation at point.

** Keyboard Macros

Keyboard macros are incredibly useful to apply repetitive changes in close proximity.
Press =F3= to start recording key presses.
Press =F4= to end the recording and bind it to the same key.

** Debugging Using GDB

Activate by =M-x gdb= followed by =M-x gdb-many-windows=.
The toolbar contain debugger navigation icons so you may want to enable it using =M-x tool-bar-mode=.
Keybindings are listed in section [[*GDB (debugger)][GDB (debugger)]].


* Setup of External Tools

Unfortunately the [[#init-file][Emacs init file]] is not self contained.
External tools are required to support many packages.

** Terminal Mode Copy+Paste

Install ~xclip~ to make Emacs running in terminal mode copy to the X clipboard.

#+begin_src bash
  apt install xclip
#+end_src

** Shell Script Mode

Install the shellcheck linter to get good advice on shell script constructs.

Ubuntu/Debian specific instruction:
#+begin_src bash
  apt install shellcheck
#+end_src

** PlantUML Documentation

Install [[https://plantuml.com/][PlantUML]].

Ubuntu/Debian specific instruction:
#+begin_src bash
  apt install plantuml
#+end_src

