html/README.html
<div id="outline-container-org240181a" class="outline-3">
<h3 id="org240181a"><span class="section-number-3">2.2.</span> Incremental Search</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Don't forget about the occur mode when doing incremental search.
It's very useful to get a navigable outline of all current matches.
</p>

<p>
All keybindings can be listed by invoking <code>C-h b</code> when in search mode.
</p>

<p>
Starting search:
</p>

<dl class="org-dl">
<dt><code>C-s</code></dt><dd>Search forward for a literal string</dd>
<dt><code>C-r</code></dt><dd>Search backward for a literal string</dd>
<dt><code>C-M-s</code></dt><dd>Search forward for a regexp</dd>
<dt><code>C-M-r</code></dt><dd>Search backward for a regexp</dd>
<dt><code>M-s _</code></dt><dd>Search forward for a symbol</dd>
<dt><code>M-s .</code></dt><dd>Search forward for the symbol at point</dd>
</dl>

<p>
During search:
</p>

<dl class="org-dl">
<dt><code>C-s</code></dt><dd>Move to next match (<code>C-s C-s</code> to resume search)</dd>
<dt><code>C-r</code></dt><dd>Move to previous match (<code>C-r C-r</code> to resume search)</dd>
<dt><code>C-g</code></dt><dd>Abort search</dd>
<dt><code>M-c</code></dt><dd>Toggle case sensitive search</dd>
<dt><code>M-e</code></dt><dd>Edit search term</dd>
<dt><code>M-s o</code></dt><dd>Outline of current matches (occur)</dd>
<dt><code>M-s SPC</code></dt><dd>Toggle lax whitespace</dd>
<dt><code>RET</code></dt><dd>Terminate search, leaving cursor at the current match</dd>
</dl>
</div>
</div>
<div id="outline-container-org40d21d3" class="outline-3">
<h3 id="org40d21d3"><span class="section-number-3">2.3.</span> Completion in Buffers</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Completion is provided by <a href="https://github.com/minad/corfu">Corfu</a> together with <a href="https://github.com/oantolin/orderless">Orderless</a>.
Completion is triggered by <code>C-M-i</code> which is bound to <code>complete-symbol</code>.
The TAB key is also configured to either indent (if it can), else complete.
This does not work in the C/C++ mode.
</p>

<p>
The completion mechanism provided by orderless is a bit different and can take some time to get used to.
Multiple patterns (space separated words) can be entered.
Completions candidates that match all patterns regardless of order are kept.
Patterns can be regexps as well as regular words, e.g. <code>^desc</code> match candidates starting with <code>desc</code>.
</p>

<p>
The built-in <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Dynamic-Abbrevs.html">dabbrev</a> mode can also be useful.
</p>

<dl class="org-dl">
<dt><code>M-/</code></dt><dd>dabbrev-expand</dd>
<dt><code>C-M-/</code></dt><dd>dabbrev-completion</dd>
</dl>
</div>
</div>
<div id="outline-container-org61a7e37" class="outline-3">
<h3 id="org61a7e37"><span class="section-number-3">2.4.</span> Minibuffer Completion</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<a href="https://github.com/minad/vertico">Vertico</a> together with <a href="https://github.com/minad/marginalia">Marginalia</a> and <a href="https://github.com/oantolin/orderless">Orderless</a> is used to enhance minibuffer completions.
For example selecting buffers, files or the function to invoke via <code>M-x</code>.
</p>

<dl class="org-dl">
<dt><code>TAB</code>  </dt><dd>Navigate to selected candidate</dd>
<dt><code>RET</code>  </dt><dd>Accept selected candidate</dd>
<dt><code>M-RET</code></dt><dd>Submit exactly what is typed (ignore candidate completion)</dd>
<dt><code>C-g</code>  </dt><dd>Abort (as always)</dd>
</dl>

<p>
Searching for previous selections is done using <code>C-s</code> and <code>C-r</code>.
Navigation is performed using the usual keybindings.
</p>
</div>
</div>
<div id="outline-container-org11ac5e8" class="outline-3">
<h3 id="org11ac5e8"><span class="section-number-3">2.5.</span> Magit</h3>
<div class="outline-text-3" id="text-2-5">
<p>
<a href="https://magit.vc">Magit</a> is a complete text-based user interface to Git.
The magit status command is bound to <code>C-x g</code>.
</p>
</div>
</div>
<div id="outline-container-orgbc07616" class="outline-3">
<h3 id="orgbc07616"><span class="section-number-3">2.6.</span> Denote</h3>
<div class="outline-text-3" id="text-2-6">
<p>
The YouTube presentation <a href="https://www.youtube.com/watch?v=mLzFJcLpDFI">https://www.youtube.com/watch?v=mLzFJcLpDFI</a> by the package author gives a good overview of the note taking workflow.
I recommend studying the <a href="https://protesilaos.com/emacs/denote">manual</a> for further details.
</p>
</div>
</div>
<div id="outline-container-org502519d" class="outline-3">
<h3 id="org502519d"><span class="section-number-3">2.7.</span> Org Mode</h3>
<div class="outline-text-3" id="text-2-7">
<p>
<a href="http://orgmode.org">Org mode</a> is a documentation and planning major mode.
Some HOWTO notes are kept in <a href="docs/howto-org-mode.html">docs/howto-org-mode.html</a>.
</p>

<p>
The <code>org-tempo</code> package is enabled which provides some template instantiation shortcuts.
Invoke <code>M-x describe-variable</code> and enter <code>org-tempo-tags</code> to see all shortcuts.
Useful shortcuts include <code>&lt;s</code> <i>TAB</i> for source blocks and <code>&lt;q</code> <i>TAB</i> for quote blocks.
</p>
</div>
</div>
<div id="outline-container-org2d015bf" class="outline-3">
<h3 id="org2d015bf"><span class="section-number-3">2.8.</span> Text Templates</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Text template support is provided by the <a href="https://github.com/joaotavora/yasnippet">yasnippet</a> package. Sippets are kept under<br />
<code>~/.emacs.d/&lt;MODE&gt;/&lt;FILE&gt;</code> and they are are expanded by typing their name and pressing
<i>TAB</i>.
</p>
</div>
</div>
<div id="outline-container-org144e520" class="outline-3">
<h3 id="org144e520"><span class="section-number-3">2.9.</span> Diagnostics</h3>
<div class="outline-text-3" id="text-2-9">
<p>
Diagnostics such as compiler errors are provied by either the flycheck or flymake package.
</p>
</div>
</div>
<div id="outline-container-org68555a3" class="outline-3">
<h3 id="org68555a3"><span class="section-number-3">2.10.</span> Language Server Protocol Support</h3>
<div class="outline-text-3" id="text-2-10">
<p>
<a href="https://github.com/joaotavora/eglot/blob/master/MANUAL.md">Eglot</a> works in concert with project.el to identify <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Projects.html">projects</a>.
Only version controlled directories can become projects.
Eglot can only analyze files that belongs to a project.
</p>

<p>
Invoke <code>M-x p p</code> to add a project, select the <i>&#x2026; (choose a dir)</i> option.
Tracked projects are stored in <code>~/.emacs.d/projects</code>.
</p>

<p>
Eglot must be started manually from an opened file that belongs to a project.
This is done by invoking <code>M-x eglot</code>.
Eglot may ask for the language server to use if it can't find one or there are multiple choices.
After having done this once, eglot does not prompt for other files in the same project.
</p>

<p>
Eglot is well integrated with core Emacs packages.
Apart from the mentioned xref it use the eldoc package to display documentation and type information.
Invoke <code>C-h .</code> to show documentation at point.
</p>
</div>
</div>
<div id="outline-container-org70aaa5a" class="outline-3">
<h3 id="org70aaa5a"><span class="section-number-3">2.11.</span> Keyboard Macros</h3>
<div class="outline-text-3" id="text-2-11">
<p>
Keyboard macros are incredibly useful to apply repetitive changes in close proximity.
Press <code>F3</code> to start recording key presses.
Press <code>F4</code> to end the recording and bind it to the same key.
</p>
</div>
</div>
<div id="outline-container-org54b58fb" class="outline-3">
<h3 id="org54b58fb"><span class="section-number-3">2.12.</span> Debugging Using GDB</h3>
<div class="outline-text-3" id="text-2-12">
<p>
Activate by <code>M-x gdb</code> followed by <code>M-x gdb-many-windows</code>.
The toolbar contain debugger navigation icons so you may want to enable it using <code>M-x tool-bar-mode</code>.
Keybindings are listed in section <a href="#org42b8d05">GDB (debugger)</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-org2fe1157" class="outline-2">
<h2 id="org2fe1157"><span class="section-number-2">3.</span> Setup of External Tools</h2>
<div class="outline-text-2" id="text-3">
<p>
Unfortunately the <a href="#init-file">Emacs init file</a> is not self contained.
External tools are required to support many packages.
</p>
</div>
<div id="outline-container-org560d360" class="outline-3">
<h3 id="org560d360"><span class="section-number-3">3.1.</span> Terminal Mode Copy+Paste</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Install <code>xclip</code> to make Emacs running in terminal mode copy to the X clipboard.
</p>

<div class="org-src-container">
<pre class="src src-bash">apt install xclip
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd93c59b" class="outline-3">
<h3 id="orgd93c59b"><span class="section-number-3">3.2.</span> Shell Script Mode</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Install the shellcheck linter to get good advice on shell script constructs.
</p>

<p>
Ubuntu/Debian specific instruction:
</p>
<div class="org-src-container">
<pre class="src src-bash">apt install shellcheck
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb6cb655" class="outline-3">
<h3 id="orgb6cb655"><span class="section-number-3">3.3.</span> PlantUML Documentation</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Install <a href="https://plantuml.com/">PlantUML</a>.
</p>

<p>
Ubuntu/Debian specific instruction:
</p>
<div class="org-src-container">
<pre class="src src-bash">apt install plantuml
</pre>
</div>
</div>
</div>
