README.org
** Go Programming Language Mode

Install the Go programming language toolchain as instructed on https://go.dev/dl/

Install required tools:
#+begin_src bash
  go install golang.org/x/tools/gopls@latest
  go install golang.org/x/tools/cmd/goimports@latest
  go install golang.org/x/tools/cmd/gorename@latest
  go install github.com/rogpeppe/godef@latest
#+end_src

** OCaml Programming Language Mode

Install the OCaml language toolchain from https://ocaml.org/releases/

Install required tools:
#+begin_src bash
  opam update
  opam switch create 4.13.1
  opam install dune utop ocaml-lsp-server merlin tuareg ocp-indent odig
#+end_src

The OCaml setup is a bit special in that the Emacs packages are installed by the steps above.
Not by the Emacs package manager.

** Python Programming Language Mode
*** Python Virtual Environments

Pyenv is used to compartmentalize python installations and make it possible to switch between them for different projects.

Install pyenv from https://github.com/pyenv/pyenv:

Clone the pyenv repo:
#+begin_src bash
  git clone https://github.com/pyenv/pyenv.git ~/.pyenv
  cd ~/.pyenv && src/configure && make -C src
#+end_src

Put the following in =~/.bashrc=:
#+begin_src bash
  export PYENV_ROOT="$HOME/.pyenv"
  if [ -d "$PYENV_ROOT" ]; then
      command -v pyenv >/dev/null || export PATH="$PYENV_ROOT/bin:$PATH"
      eval "$(pyenv init -)"
  fi
#+end_src

Apply the changes in the current shell (or login again):
#+begin_src bash
  exec "$SHELL"
#+end_src

Install Python build dependencies (Ubuntu specific, refer to https://github.com/pyenv/pyenv/wiki#suggested-build-environment for other OSes):
#+begin_src bash
  sudo apt-get update
  sudo apt-get install make build-essential libssl-dev zlib1g-dev libbz2-dev \
       libreadline-dev libsqlite3-dev wget curl llvm libncursesw5-dev xz-utils \
       tk-dev libxml2-dev libxmlsec1-dev libffi-dev liblzma-dev
#+end_src

Install a Python version using pyenv:
#+begin_src bash
  pyenv install 3.10.7
#+end_src

Switching between Python versions:

- =pyenv shell VERSION= :: Select just for current shell session.
- =pyenv local VERSION= :: Automatically select whenever you are in the
  current directory (or its subdirectories).
- =pyenv global VERSION= :: Select globally for your user account.

*** Language Server

Install the language server:
#+begin_src bash
  pip install 'python-language-server[all]' scrapy
#+end_src

** Zig Programming Language Mode

- Install the language toolchain from https://ziglang.org/download/
- Install the language server from https://github.com/zigtools/zls/


* Compiling GNU Emacs

Compiling [[https://www.gnu.org/software/emacs/][GNU Emacs]] from source is quite easy.
Many packages see heavy development and may require a recent version.

** Emacs 30.2

Install dependencies (Ubuntu 22.04 specific):

#+begin_src bash
  sudo apt install \
     libcairo2-dev \
     libgif-dev \
     libgnutls28-dev \
     libharfbuzz-dev \
     libjansson-dev \
     libjpeg-dev \
     libncurses-dev \
     librsvg2-dev \
     libsqlite3-dev \
     libtiff-dev \
     libtree-sitter-dev \
     libxaw7-dev \
     libxml2-dev \
     libxpm-dev
#+end_src

Install the libgccjit package corresponding to GCC compiler version.
Check compiler version with ~gcc --version~.

Example: Install libgccjit corresponding to GCC version

#+begin_src bash
  apt install libgccjit-11-dev:amd64
#+end_src

Download, configure, build and install GNU Emacs on Linux:

#+begin_src bash
  wget https://ftp.acc.umu.se/mirror/gnu.org/gnu/emacs/emacs-30.2.tar.xz
  tar xf emacs-30.2.tar.xz
  cd emacs-30.2
  ./configure \
      --with-native-compilation \
      --with-mailutils \
      --with-x-toolkit=lucid \
      --with-tree-sitter \
      --prefix=$HOME/.local
  make -j16
  make install
#+end_src

Make sure that Cairo is used for the GUI in the configure stage or some library dependency is missing.

Install tree-sitter language grammar files using =M-x treesit-install-language-grammar=;
example language names: python, c, cpp.

See https://www.masteringemacs.org/article/how-to-get-started-tree-sitter for an introduction to Emacs tree-sitter support and how to use it.

For now, none of the tree-sitter major modes are enabled by default.
