html/README.html
<div id="outline-container-org546bc4c" class="outline-3">
<h3 id="org546bc4c"><span class="section-number-3">3.4.</span> Go Programming Language Mode</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Install the Go programming language toolchain as instructed on <a href="https://go.dev/dl/">https://go.dev/dl/</a>
</p>

<p>
Install required tools:
</p>
<div class="org-src-container">
<pre class="src src-bash">go install golang.org/x/tools/gopls@latest
go install golang.org/x/tools/cmd/goimports@latest
go install golang.org/x/tools/cmd/gorename@latest
go install github.com/rogpeppe/godef@latest
</pre>
</div>
</div>
</div>
<div id="outline-container-org58689b9" class="outline-3">
<h3 id="org58689b9"><span class="section-number-3">3.5.</span> OCaml Programming Language Mode</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Install the OCaml language toolchain from <a href="https://ocaml.org/releases/">https://ocaml.org/releases/</a>
</p>

<p>
Install required tools:
</p>
<div class="org-src-container">
<pre class="src src-bash">opam update
opam switch create 4.13.1
opam install dune utop ocaml-lsp-server merlin tuareg ocp-indent odig
</pre>
</div>

<p>
The OCaml setup is a bit special in that the Emacs packages are installed by the steps above.
Not by the Emacs package manager.
</p>
</div>
</div>
<div id="outline-container-orge2fe087" class="outline-3">
<h3 id="orge2fe087"><span class="section-number-3">3.6.</span> Python Programming Language Mode</h3>
<div class="outline-text-3" id="text-3-6">
</div>
<div id="outline-container-org853d64f" class="outline-4">
<h4 id="org853d64f"><span class="section-number-4">3.6.1.</span> Python Virtual Environments</h4>
<div class="outline-text-4" id="text-3-6-1">
<p>
Pyenv is used to compartmentalize python installations and make it possible to switch between them for different projects.
</p>

<p>
Install pyenv from <a href="https://github.com/pyenv/pyenv">https://github.com/pyenv/pyenv</a>:
</p>

<p>
Clone the pyenv repo:
</p>
<div class="org-src-container">
<pre class="src src-bash">git clone https://github.com/pyenv/pyenv.git ~/.pyenv
cd ~/.pyenv &amp;&amp; src/configure &amp;&amp; make -C src
</pre>
</div>

<p>
Put the following in <code>~/.bashrc</code>:
</p>
<div class="org-src-container">
<pre class="src src-bash">export PYENV_ROOT="$HOME/.pyenv"
if [ -d "$PYENV_ROOT" ]; then
    command -v pyenv &gt;/dev/null || export PATH="$PYENV_ROOT/bin:$PATH"
    eval "$(pyenv init -)"
fi
</pre>
</div>

<p>
Apply the changes in the current shell (or login again):
</p>
<div class="org-src-container">
<pre class="src src-bash">exec "$SHELL"
</pre>
</div>

<p>
Install Python build dependencies (Ubuntu specific, refer to <a href="https://github.com/pyenv/pyenv/wiki#suggested-build-environment">https://github.com/pyenv/pyenv/wiki#suggested-build-environment</a> for other OSes):
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo apt-get update
sudo apt-get install make build-essential libssl-dev zlib1g-dev libbz2-dev \
     libreadline-dev libsqlite3-dev wget curl llvm libncursesw5-dev xz-utils \
     tk-dev libxml2-dev libxmlsec1-dev libffi-dev liblzma-dev
</pre>
</div>

<p>
Install a Python version using pyenv:
</p>
<div class="org-src-container">
<pre class="src src-bash">pyenv install 3.10.7
</pre>
</div>

<p>
Switching between Python versions:
</p>

<dl class="org-dl">
<dt><code>pyenv shell VERSION</code></dt><dd>Select just for current shell session.</dd>
<dt><code>pyenv local VERSION</code></dt><dd>Automatically select whenever you are in the
current directory (or its subdirectories).</dd>
<dt><code>pyenv global VERSION</code></dt><dd>Select globally for your user account.</dd>
</dl>
</div>
</div>
<div id="outline-container-orgd41afaa" class="outline-4">
<h4 id="orgd41afaa"><span class="section-number-4">3.6.2.</span> Language Server</h4>
<div class="outline-text-4" id="text-3-6-2">
<p>
Install the language server:
</p>
<div class="org-src-container">
<pre class="src src-bash">pip install 'python-language-server[all]' scrapy
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf47b1d2" class="outline-3">
<h3 id="orgf47b1d2"><span class="section-number-3">3.7.</span> Zig Programming Language Mode</h3>
<div class="outline-text-3" id="text-3-7">
<ul class="org-ul">
<li>Install the language toolchain from <a href="https://ziglang.org/download/">https://ziglang.org/download/</a></li>
<li>Install the language server from <a href="https://github.com/zigtools/zls/">https://github.com/zigtools/zls/</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc41fd85" class="outline-2">
<h2 id="orgc41fd85"><span class="section-number-2">4.</span> Compiling GNU Emacs</h2>
<div class="outline-text-2" id="text-4">
<p>
Compiling <a href="https://www.gnu.org/software/emacs/">GNU Emacs</a> from source is quite easy.
Many packages see heavy development and may require a recent version.
</p>
</div>
<div id="outline-container-orgf62032b" class="outline-3">
<h3 id="orgf62032b"><span class="section-number-3">4.1.</span> Emacs 30.2</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Install dependencies (Ubuntu 22.04 specific):
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo apt install \
   libcairo2-dev \
   libgif-dev \
   libgnutls28-dev \
   libharfbuzz-dev \
   libjansson-dev \
   libjpeg-dev \
   libncurses-dev \
   librsvg2-dev \
   libsqlite3-dev \
   libtiff-dev \
   libtree-sitter-dev \
   libxaw7-dev \
   libxml2-dev \
   libxpm-dev
</pre>
</div>

<p>
Install the libgccjit package corresponding to GCC compiler version.
Check compiler version with <code>gcc --version</code>.
</p>

<p>
Example: Install libgccjit corresponding to GCC version
</p>

<div class="org-src-container">
<pre class="src src-bash">apt install libgccjit-11-dev:amd64
</pre>
</div>

<p>
Download, configure, build and install GNU Emacs on Linux:
</p>

<div class="org-src-container">
<pre class="src src-bash">wget https://ftp.acc.umu.se/mirror/gnu.org/gnu/emacs/emacs-30.2.tar.xz
tar xf emacs-30.2.tar.xz
cd emacs-30.2
./configure \
    --with-native-compilation \
    --with-mailutils \
    --with-x-toolkit=lucid \
    --with-tree-sitter \
    --prefix=$HOME/.local
make -j16
make install
</pre>
</div>

<p>
Make sure that Cairo is used for the GUI in the configure stage or some library dependency is missing.
</p>

<p>
Install tree-sitter language grammar files using <code>M-x treesit-install-language-grammar</code>;
example language names: python, c, cpp.
</p>

<p>
See <a href="https://www.masteringemacs.org/article/how-to-get-started-tree-sitter">https://www.masteringemacs.org/article/how-to-get-started-tree-sitter</a> for an introduction to Emacs tree-sitter support and how to use it.
</p>

<p>
For now, none of the tree-sitter major modes are enabled by default.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <i>2024-10-05</i></p>
</div>
</body>
</html>
